In [1]:
import pandas as pd

# Q1: Create a panda series without using dictionary

In [2]:
inde_x= ['a','x','c','2','e']

val=[1,4,9,6,7]

series= pd.Series(val,index=inde_x,dtype='int64')
print(series)

a    1
x    4
c    9
2    6
e    7
dtype: int64

# Q2: Write pandas series code using dictionary:

In [3]:
data = {'Bilal': 42,'Ayesha':28,'Hadia':39}
series = pd.Series(data,dtype='int64')
print(series)

Bilal     42
Ayesha    28
Hadia     39
dtype: int64

# Q3: Write pandas dataframe code using python dictionary

In [17]:
data = {
    'day': ['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017', '1/5/2017', '1/6/2017'],
    'temperature': [32, 35, 28, 24, 22, 21],
    'windspeed': [6, 7, 2, 7, 4, 2],
    'event': ['Rain', 'Sunny', 'Snow', 'Snow', 'Rain', 'Sunny']
}
df = pd.DataFrame(data)
print(df)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           22          4   Rain
5  1/6/2017           21          2  Sunny

# Q4: Q.4: In extension to above question, replace index by ['a','b','c','d','e','f']

In [19]:
data = {
    'day': ['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017', '1/5/2017', '1/6/2017'],
    'temperature': [32, 35, 28, 24, 22, 21],
    'windspeed': [6, 7, 2, 7, 4, 2],
    'event': ['Rain', 'Sunny', 'Snow', 'Snow', 'Rain', 'Sunny']
}
index = ['a', 'b', 'c', 'd', 'e', 'f']
df = pd.DataFrame(data, index=index)
print(df)

        day  temperature  windspeed  event
a  1/1/2017           32          6   Rain
b  1/2/2017           35          7  Sunny
c  1/3/2017           28          2   Snow
d  1/4/2017           24          7   Snow
e  1/5/2017           22          4   Rain
f  1/6/2017           21          2  Sunny

# Q5: In extension to above Q.3, calculate mean, miximum and minimum for label “temperature”

In [21]:
data = {
    'day': ['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017', '1/5/2017', '1/6/2017'],
    'temperature': [32, 35, 28, 24, 22, 21],
    'wndspeed': [6, 7, 2, 7, 4, 2],
    'event': ['Rain', 'Sunny', 'Snow', 'Snow', 'Rain', 'Sunny']
}
df = pd.DataFrame(data)
temperature_mean = df['temperature'].mean()
temperature_max = df['temperature'].max()
temperature_min = df['temperature'].min()

print("Mean temperature:", temperature_mean)
print("Maximum temperature:", temperature_max)
print("Minimum temperature:", temperature_min)

Mean temperature: 27.0
Maximum temperature: 35
Minimum temperature: 21

# Q6: Import CSV ‘people.csv’ in the given folder

In [23]:
file = pd.read_csv('people.csv',usecols = ["First Name","Sex","Email","Phone","Job Title"],index_col = ["Sex","Job Title"],skiprows = [1,5])

file.to_csv('NewPeople.csv')

file

                                First Name                       Email  \
Sex    Job Title
Female Phytotherapist              Phillip       bethany14@example.com
Male   Homeopath                  Kristine       bthompson@example.com
       Market researcher           Yesenia   kaitlinkaiser@example.com
       Waste management officer       Erin         tconner@example.org
Female Intelligence analyst      Katherine     conniecowan@example.com
...                                    ...                         ...
       Software engineer            Dennis         bmartin@example.org
       Barrister                     Steve       latasha46@example.net
Male   Police officer               Wesley        regina11@example.org
Female Broadcast journalist         Summer  alexiscantrell@example.org
Male   IT sales professional        Mariah       pcopeland@example.org

                                                 Phone
Sex    Job Title
Female Phytotherapist                214.112.6044x4913
Male   Homeopath                          277.609.7938
       Market researcher                  584.094.6111
       Waste management officer  001-171-649-9856x5553
Female Intelligence analyst      +1-773-151-6685x49162
...                                                ...
       Software engineer          001-095-524-2112x257
       Barrister                      001-865-478-5157
Male   Police officer               995-542-3004x76800
Female Broadcast journalist       001-273-685-6932x092
Male   IT sales professional       (341)594-6554x44657

[98 rows x 3 columns]

# Q7: Import excel sheet ‘SampleWork.xlsx’ in the given folder

In [24]:
data = pd.read_excel('SampleWork.xlsx', sheet_name='Sheet1', usecols=[0, -1], skiprows=[1], header=1)

In [25]:
data.to_excel('NewSheet.xlsx', index=False) 
data

    Bilal
0  Sufyan
1   Saiqa
2   Aimen

# Q8: Create the following dataframe as AICP_DF then implement different operations as described below

In [26]:
data = {
    'Name': ['Sonia', 'Bilal', 'Hifza', 'Kabir', 'Jazim'],
    'Age': [27, 24, 22, 32, 23],
    'Address': ['Lahore', 'Karachi', 'Sialkot', 'Peshawar', 'lhr'],
    'Qualification': ['MsC', 'MA', 'MCA', 'Phd', 'bsc'],
}

AICP_DF = pd.DataFrame(data)
AICP_DF

    Name  Age   Address Qualification
0  Sonia   27    Lahore           MsC
1  Bilal   24   Karachi            MA
2  Hifza   22   Sialkot           MCA
3  Kabir   32  Peshawar           Phd
4  Jazim   23       lhr           bsc

In [27]:
# 1)select 'Name', 'Qualification' coloumns and save to df1
df1 = AICP_DF[['Name', 'Qualification']].copy()
df1

    Name Qualification
0  Sonia           MsC
1  Bilal            MA
2  Hifza           MCA
3  Kabir           Phd
4  Jazim           bsc

In [28]:
# 2)add a new column to AICP_DF “Height” with the following values: [5.1, 6.2, 5.1, 5.2,5.1]
AICP_DF['Height'] = [5.1, 6.2, 5.1, 5.2, 5.1]
AICP_DF

    Name  Age   Address Qualification  Height
0  Sonia   27    Lahore           MsC     5.1
1  Bilal   24   Karachi            MA     6.2
2  Hifza   22   Sialkot           MCA     5.1
3  Kabir   32  Peshawar           Phd     5.2
4  Jazim   23       lhr           bsc     5.1

In [29]:
# 3)set column “Name” as the index column:
AICP_DF.set_index('Name', inplace=True)
AICP_DF

       Age   Address Qualification  Height
Name
Sonia   27    Lahore           MsC     5.1
Bilal   24   Karachi            MA     6.2
Hifza   22   Sialkot           MCA     5.1
Kabir   32  Peshawar           Phd     5.2
Jazim   23       lhr           bsc     5.1

In [30]:
# 4)retrieve row with index “Hifza”
row_hifza = AICP_DF.loc['Hifza']
row_hifza

Age                   22
Address          Sialkot
Qualification        MCA
Height               5.1
Name: Hifza, dtype: object

In [31]:
# 5)retrieve row with index 3
row_three = AICP_DF.iloc[2]
row_three

Age                   22
Address          Sialkot
Qualification        MCA
Height               5.1
Name: Hifza, dtype: object

In [32]:
# 6)drop row with index “Bilal”
AICP_DF.drop('Bilal', inplace=True)
AICP_DF

       Age   Address Qualification  Height
Name
Sonia   27    Lahore           MsC     5.1
Hifza   22   Sialkot           MCA     5.1
Kabir   32  Peshawar           Phd     5.2
Jazim   23       lhr           bsc     5.1